# Задание выполнил Смирнов Никита из группы 0482-05
#Задание
name = input("Введите ваше имя: ")
surname = input("Введите вашу фамилию: ")
age = input("Введите ваш возраст: ")

a = "Ваше имя: {}, Фамилия: {}, Возраст: {} лет.".format(name, surname, age)
print(a)

b = f"Ваше имя: {name}, Фамилия: {surname}, Возраст: {age} лет."
print(b)
