# Задание выполнил Смирнов Никита из группы 0482-05
#Задание
имя = input("Введите ваше имя: ")
фамилия = input("Введите вашу фамилию: ")
возраст = input("Введите ваш возраст: ")

a = "Ваше имя: {}, Фамилия: {}, Возраст: {} лет.".format(имя, фамилия, возраст)
print(a)

b = f"Ваше имя: {имя}, Фамилия: {фамилия}, Возраст: {возраст} лет."
print(b)
